Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Then, your application can generate messages and publish them to the `prices-out` channel. It can use `double` payloads as in the following snippet:
zh_cn: 然后，您的程序可以生成消息并将其发布到 `prices-out` channel。它可以使用 `double` payloads，如下所示：

source: There are 2 `@Blocking` annotations:
zh_cn: 有2种 `@Blocking` 注解：

source: There are a few steps to get your lambda running on AWS. The generated maven project contains a helpful script to create, update, delete, and invoke your lambdas for pure Java and native deployments.
zh_cn: 有几个步骤可以让lambda在AWS上运行。生成的maven项目包含一个有用的脚本，来为纯Java和原生部署创建、更新、删除和调用你的lambda。

source: There are a lot of different configuration options that can affect how the native executable is generated. These are provided in `application.properties` the same as any other config property.
zh_cn: 有很多不同的配置选项可以影响原生可执行文件的生成方式。这些都是在 `application.properties` ，与其他配置属性相同。

source: There are always new users trying to get started quickly. Share your experience with everyone by writing a Quickstart and submitting it for peer review.
zh_cn: 总有一些新用户试图快速入门。通过撰写 "快速入门 "并提交给同行评审，与大家分享你的经验。

source: There are cases where the initialization of certain classes is done in a static block needs to be postponed to runtime. Typically omitting such configuration would result in a runtime exception like the following:
zh_cn: 有些情况下，某些类的初始化是在静态块中完成的，需要推迟到运行时。通常情况下，省略这样的配置会导致运行时的异常，如下所示：

source: There are heaps of helpful <a href="{{site.baseurl}}/publications">articles and blog posts</a> out there presenting interesting use-cases and examples of Quarkus in action.
zh_cn: 有很多有用的<a href="{{site.baseurl}}/publications">文章和博文</a>，介绍了Quarkus的有趣用例和实际应用的例子。

source: There are several other ways your application can consume incoming messages:
zh_cn: 您的应用程序还可以通过另外集中方式来消费接收到的消息：

source: There are three configuration settings that alter the RBAC Deny behavior:
zh_cn: 有三个配置项可以改变RBAC拒绝行为：

source: There are times you may want to set a specific system properties or other arguments when lambda invokes your native quarkus lambda deployment. If you include a `bootstrap` script file within `zip.native`, the quarkus extension will automatically rename the executable to `runner` within `function.zip` and set the unix mode of the `bootstrap` script to executable.
zh_cn: 有些时候你可能想在lambda调用你的原生quarkus lambda部署时设置特定的系统属性或其他参数。如果你在 `zip.native` 中包含一个 `bootstrap` 脚本文件，quarkus 扩展会在 `function.zip` 中自动将可执行文件重命名为 `runner` ，并将 `bootstrap` 脚本的 unix 模式设置为可执行。

source: There are two different ways to fix this type of issues.
zh_cn: 有两种不同的方法来解决这种类型的问题。

source: There are two ways to configure the OTLP gRPC Exporter within the application.
zh_cn: 有两种方法可以在应用程序中配置OTLP gRPC exporter。

source: There is an existing `JsonbSerializer` that can be used to serialize all data objects via JSON-B. You may create an empty subclass if you want to use <<serialization-autodetection>>.
zh_cn: 有一个现有的 `JsonbSerializer` ，可以通过JSON-B来序列化所有的数据对象。如果您想使用 link:#serialization-autodetection[[序列化自动侦测]] ，您可以创建一个空的子类类继承它。

source: There is an existing `ObjectMapperSerializer` that can be used to serialize all data objects via Jackson. You may create an empty subclass if you want to use <<serialization-autodetection>>.
zh_cn: 有一个现有的 `ObjectMapperSerializer` ，可以用来通过Jackson来序列化所有的数据对象。如果您想使用 link:#serialization-autodetection[[自动侦测序列化]] ，您可以创建一个空的子类来继承该类。

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda-http` extension (if you are deploying an AWS Gateway HTTP API) or the `quarkus-amazon-lambda-rest` extension (if you are deploying an AWS Gateway REST API). These extensions automatically generate everything you might need for your lambda deployment.
zh_cn: 除了包含 `quarkus-amazon-lambda-http` 扩展（如果你要部署AWS Gateway HTTP API）或 `quarkus-amazon-lambda-rest` 扩展（如果你要部署AWS Gateway REST API）外，POM没有什么特别之处。这些扩展会自动生成你的lambda部署可能需要的一切。

source: There is nothing special about the POM other than the inclusion of the `quarkus-amazon-lambda` extension as a dependency. The extension automatically generates everything you might need for your lambda deployment.
zh_cn: 除了将 `quarkus-amazon-lambda` 扩展作为一个依赖项之外，POM并没有什么特别之处。该扩展会为你的lambda部署自动生成可能需要的一切。

source: There is only one thing to remember: if you use `Response` and Quarkus can't determine the beans that are serialized, you need to annotate them with `@RegisterForReflection`.
zh_cn: 只有一件事要记住：如果您使用 `Response` 并且 Quarkus 无法确定被序列化的 bean，则需要使用 `@RegisterForReflection` 注解它们。

source: Therefore, if you want to use a data class as an entity class, you need a way to make Kotlin generate an empty constructor. To do so, you need to provide default values for all the fields of your classes. The following sentence from the Kotlin documentation explains it:
zh_cn: 因此，如果你想使用一个数据类作为实体类，你需要一种方法来使Kotlin生成一个空的构造函数。要做到这一点，你需要为你的类的所有字段提供默认值。下面这句话来自Kotlin文档的解释：

source: These are normal Quarkus config properties, so if you always want to build in a container it is recommended you add these to your `application.properties` in order to avoid specifying them every time.
zh_cn: 这些是标准的Quarkus配置属性，所以如果你总是想在容器中构建，建议你把这些添加到你的 `application.properties` ，以避免每次都指定它们。

source: These endpoints are protected and can only be accessed if a client is sending a bearer token along with the request, which must be valid (e.g.: signature, expiration and audience) and trusted by the microservice.
zh_cn: 这些节点是受保护的，只有当客户端将一个bearer token与请求一起发送时才能被访问，而且该token必须是有效的（例如：签名、过期时间和受众），并且要得到微服务的信任。

source: These instructions will get you a copy of the Quarkus.io website up and running on your local machine for development and testing purposes.
zh_cn: 这些指令会给你一份Quarkus.io网站的副本，启动并运行在本地机器上，用于开发和测试。

source: These properties can be set through Java's `-D` command line parameter or on `application.properties`.
zh_cn: 这些属性可以通过 Java 的 `-D` 命令行参数或在 `application.properties` 上设置。

source: These tests use http://rest-assured.io/[RestAssured], but feel free to use your favorite library.
zh_cn: 这些测试使用 link:http://rest-assured.io/[RestAssured] ，但也可以随意使用你最喜欢的库。

source: These types differ from the Java types mentioned in those tutorials. For Kotlin support, all the Panache types will be found in the `io.quarkus.mongodb.panache.kotlin` package. This subpackage allows for the distinction between the Java and Kotlin variants and allows for both to be used unambiguously in a single project.
zh_cn: 这些类型与那些教程中提到的Java类型不同。对于Kotlin支持，所有的Panache类型将在 `io.quarkus.mongodb.panache.kotlin` 包中都可以找到。这个子包允许区分Java和Kotlin变体，并允许在一个项目中明确地使用这两种类型。

source: They have the same effect. Thus, you can use both. The first one provides more fine-grained tuning such as the worker pool to use and whether it preserves the order. The second one, used also with other reactive features of Quarkus, uses the default worker pool and preserves the order.
zh_cn: 它们效果相同。因此，您可以随意使用。第一个提供了更精细的配置，比如worker pool以及是否保留顺序。第二种，同其他的Quarkus Reactive功能类似，使用默认的worker pool并且保留了顺序。

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
zh_cn: 可以将Quarkus扩展视为您的项目依赖项。扩展可以配置、引导并将框架或技术集成到您的Quarkus应用程序中。它们还做了所有繁重的工作，为GraalVM提供正确的信息，以便应用程序本地编译。这将允许第三方项目轻松地利用我们所做的工作，使其更容易瞄准GraalVM。

source: This `/subject/secured` endpoint requires an authenticated user that has been granted the role "Tester" through the use of the `@RolesAllowed("Tester")` annotation.
zh_cn: `/subject/secured` 节点需要一个经过认证的用户，该用户通过使用 `@RolesAllowed("Tester")` 注解被授予 "Tester "的角色。

source: This allows your reactive methods to keep on working on the transaction asynchronously until their work is really done, and not just until the reactive method returns.
zh_cn: 这允许你的响应式方法以异步方式继续在事务上工作，直到他们的工作真正完成，而不仅仅是当响应式方法返回时。

source: This annotation allows you to directly inject the URL of the Quarkus instance, the value of the annotation will be the path component of the URL
zh_cn: 该注解允许您将URL直接注入为Quarkus实例，注解的值将是URL的路径

source: This annotation defines your transaction boundaries and will wrap this call within a transaction.
zh_cn: 这个注解定义了你的事务边界，并将把这个调用包含在一个事务中。

source: This annotation may only be placed on the top level method delineating the transaction. Annotated nested methods once a transaction has started will throw an exception.
zh_cn: 这个注释只能放在划定事务的顶层方法上。一旦事务开始，被注解的嵌套方法将抛出一个异常。

source: This approach only works for JVM tests. It cannot be used for native tests (because they do not support injection).
zh_cn: 这种方法只适用于JVM测试。它不能用于原生测试(因为原生模式不支持注入)。

source: This approach provides a more limited coverage compared to the Wiremock approach - for example, the remote communication code is not covered.
zh_cn: 与Wiremock方法相比，这种方法提供了更有限的覆盖范围--例如，远程通信代码没有被覆盖。

source: This auto-attachment can be disabled using:
zh_cn: 可以用以下方法禁用这种自动连接功能：

source: This bean receives the name and returns the greeting message.
zh_cn: 这个Bean接收名字并返回响应信息。

source: This behavior can be disabled by setting the `quarkus.mongodb.health.enabled` property to `false` in your `application.properties`.
zh_cn: 可以通过在 `application.properties` 中将 `quarkus.mongodb.health.enabled` 属性设置为 `false` 来禁用此行为。

source: This behavior can be disabled by setting the `quarkus.redis.health.enabled` property to `false` in your `application.properties`.
zh_cn: 可以通过在 `application.properties` 中设置 `quarkus.redis.health.enabled` 属性为 `false` 来禁用这个连接健康检查。

source: This call to obtain the user principal will return null if the caller is unauthenticated, non-null if the caller is authenticated.
zh_cn: 如果调用者未认证，这个获取用户principal的调用会返回null, 否则不会为null。

source: This can be achieved by setting to DEBUG the following log category inside your `application.properties`:
zh_cn: 这可以通过在你的 `application.properties` ，将以下日志类别设置为DEBUG来实现：

source: This class represents `Fruits`. It's a straightforward entity with a single field (`name`). Note that it uses `io.quarkus.hibernate.reactive.panache.PanacheEntity`, the reactive variant of `PanacheEntity`. So, behind the scenes, Hibernate uses the execution model we described above. It interacts with the database without blocking the thread. In addition, this reactive `PanacheEntity` proposes a reactive API. We will use this API to implement the REST endpoint.
zh_cn: 这个类代表 `Fruits`。它是一个简单的实体，只有一个字段 (`name`)。注意，它使用的是 `io.quarkus.hibernate.reactive.panache.PanacheEntity`，是 `PanacheEntity` 的响应式类库。因此，Hibernate在幕后使用我们前面描述的执行模型。它与数据库交互而不阻塞线程。此外，这个响应式的 `PanacheEntity` 提出了一个响应式API。我们将使用这个API来实现REST端点。

source: This code configures the SockJS bridge to send all the messages targeting the `ticks` address to the connected browsers. More detailled explanations about the configuration can be found on https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[the Vert.x SockJS Bridge documentation].
zh_cn: 这段代码配置了SockJS桥接器，以将所有针对 `ticks` 地址的信息发送到所连接的浏览器。更详细的配置说明可以在 https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[Vert.x SockJS Bridge文档] 中找到。

source: This command creates the project structure and select the two Quarkus extensions we will be using:
zh_cn: 这个命令会创建项目结构，并选择我们将要使用的两个Quarkus扩展：

source: This command generates a Maven project with the `spring-scheduled` extension.
zh_cn: 该命令生成了一个包含 `spring-scheduled` 扩展项的Maven项目。

source: This command generates a Maven project, importing the `oidc` extension which is an implementation of OIDC for Quarkus.
zh_cn: 该命令生成了一个Maven项目，导入了 `oidc` 扩展，这个扩展是Quarkus的OIDC实现。

source: This command generates a Maven project, that imports the `micrometer-registry-prometheus` extension as a dependency. This extension will load the core `micrometer` extension as well as additional library dependencies required to support prometheus.
zh_cn: 该命令生成一个Maven项目，将 `micrometer-registry-prometheus` 扩展作为一个依赖导入。该扩展将加载核心的 `micrometer` 扩展，以及支持Prometheus所需的其他依赖项。

source: This command generates a Maven structure importing the RESTEasy Reactive Jackson and MongoDB Client extensions. After this, the `quarkus-mongodb-client` extension has been added to your build file.
zh_cn: 该命令生成一个导入RESTEasy Reactive Jackson和MongoDB客户端扩展的Maven结构。在此之后， `quarkus-mongodb-client` 扩展已被添加到您的构建文件中。

source: This command generates a Maven structure importing the RESTEasy Reactive Jackson and MongoDB with Panache extensions. After this, the `quarkus-mongodb-panache` extension has been added to your build file.
zh_cn: 该命令生成一个Maven结构，导入RESTEasy Reactive Jackson和MongoDB with Panache扩展。在此之后， `quarkus-mongodb-panache` 扩展已被添加到您的构建文件中。

source: This command generates a new project importing the RESTEasy Reactive/JAX-RS and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
zh_cn: 该命令生成了一个导入RESTEasy Reactive/JAX-RS和 link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] 扩展的新项目，特别是添加了以下依赖：

source: This command generates a new project importing the RESTEasy Reactive/JAX-RS and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
zh_cn: 该命令生成了一个导入RESTEasy Reactive/JAX-RS和 link:https://github.com/FasterXML/jackson[Jackson] 扩展的新项目，特别是添加了以下依赖项：

source: This command generates a new project, importing the Redis extension.
zh_cn: 该命令可生成一个新项目，并导入Redis扩展。

source: This command generates a project and imports the `spring-boot-properties` extension.
zh_cn: 该命令生成一个项目并导入了 `spring-boot-properties` 扩展。

source: This command generates a project which imports the `spring-cloud-config-client` extension.
zh_cn: 该命令生成了一个已导入 `spring-cloud-config-client` 扩展的项目。

source: This command generates a project, importing the `keycloak-authorization` extension which is an implementation of a Keycloak Adapter for Quarkus applications and provides all the necessary capabilities to integrate with a Keycloak Server and perform bearer token authorization.
zh_cn: 该命令生成一个项目并导入 `keycloak-authorization` 扩展，该扩展是一个用于Quarkus应用程序的Keycloak适配器的实现，并提供所有必要的功能来与Keycloak服务器集成并执行bearer token授权。

source: This command generates the Maven project and imports the `quarkus-opentelemetry-exporter-otlp` extension, which includes the OpenTelemetry support, and a gRPC span exporter for https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP].
zh_cn: 该命令生成Maven项目并导入 `quarkus-opentelemetry-exporter-otlp` 扩展，其中包括OpenTelemetry支持，以及 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP] 的gRPC span exporter。

source: This command generates the Maven project and imports the `smallrye-jwt` extension, which includes the {mp-jwt} support.
zh_cn: 该命令生成Maven项目并导入 `smallrye-jwt` 扩展，其中包括{mp-jwt}支持。

source: This command will start a Redis instance to execute the tests. Thus your Redis containers need to be stopped.
zh_cn: 以下命令将启动一个Redis实例以执行测试。因此，需要停掉你的Redis容器。

source: This configuration can be global (as above), or set in the channel configuration:
zh_cn: 这个配置可以是全局的(如上)，也可以在 channel 配置中设置：

source: This configuration is equivalent to the following:
zh_cn: 该配置相当于以下内容：

source: This configuration will only impact resources served from the fixed/static URL `/public`, which may not match your application resources if `quarkus.http.root-path` has been set to something other than `/`.
zh_cn: 此配置将只影响从固定/静态URL `/public` 提供的资源，如果 `quarkus.http.root-path` 被设置为其他的 `/` ，那么它可能与您的应用程序资源不匹配。

source: This connector is for AMQP 1.0. RabbitMQ implements AMQP 0.9.1. RabbitMQ does not provide AMQP 1.0 by default, but there is a plugin for it. To use RabbitMQ with this connector, enable and configure the AMQP 1.0 plugin.
zh_cn: 此连接器用于 AMQP 1.0. RabbitMQ 实现 AMQP 0.9.1。RabbitMQ 默认不提供 AMQP 1.0，但有一个插件。要将此连接器与RabbitMQ一起使用，请启用并配置 AMQP 1.0 插件。

source: This constructor will be used by Hibernate, and it must have a matching constructor with all the class attributes as parameters.
zh_cn: Hibernate会用到这个构造方法，它必须有一个匹配的构造函数，所有的类属性都是参数。

source: This constructor will be used by Hibernate, it must be the only constructor in your class and have all the class attributes as parameters.
zh_cn: Hibernate会用到这个构造方法，它必须是类中唯一的构造函数，并且包含所有类属性作为参数。

source: This currently does not support the `@ApplicationPath()` annotation to set the JAX-RS context path. Use the `quarkus.resteasy.path` config value instead if you want a custom context path.
zh_cn: 目前不支持使用 `@ApplicationPath()` 注解来设置 JAX-RS 上下文路径。如果您想要一个自定义的上下文路径，请使用 `quarkus.resteasy.path` 代替。

source: This defines a role based policy that allows users with the `user` and `admin` roles. This is referenced by later rules.
zh_cn: 定义了一个基于角色的策略来授权给具有 `user` 和 `admin` 角色的用户。该配置会被后面的规则所引用。

source: This definition is very important as we will have to use it in the service. Once we have this `Command` we can start to update the redis-client extension by:
zh_cn: 我们需要在服务中使用这个Redis命令，因此这个定义非常重要。有了这个 `Command` 定义后，我们就可以开始更新redis-client扩展。

source: This dependency provides the Vert.x Web Client, which we will be using to implement the `/web` endpoint.
zh_cn: 该依赖项提供了Vert.x Web客户端，我们将用它来实现 `/web` 端点。

source: This dependency provides the callback handler required to handle the OAuth workflow. Then, in the `application.properties`, add:
zh_cn: 这个依赖提供了处理OAuth工作流所需的回调处理器。然后，在 `application.properties` ，添加：

source: This documentation does not cover all the details of the connector. Refer to the https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging website] for further details.
zh_cn: 本文档并没有涵盖连接器的所有细节。请参考 link:https://smallrye.io/smallrye-reactive-messaging[SmallRye 响应式消息网站] ，来了解更多细节。

source: This endpoint handles HTTP `GET` request on path `/lorem` (so the full path will be `vertx/lorem`)
zh_cn: 该端点处理路径 `/lorem` 上的 HTTP `GET` 请求（因此完整路径是 `vertx/lorem` ）

source: This environment variable resolves some incompatibilities between Quarkus and the Amazon Lambda Custom Runtime environment.
zh_cn: 这个环境变量解决了Quarkus和Amazon Lambda Custom Runtime环境之间的一些不兼容问题。

source: This example corresponds to the following instructions in the Micrometer documentation: https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink
zh_cn: 这个例子对应于Micrometer文档中的以下说明 https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink

source: This explain the specifics of using Hibernate ORM with Panache in a Kotlin project.
zh_cn: 这将解释在Kotlin项目中使用Hibernate ORM与Panache的具体细节。

source: This extension is developed by a third party and is part of the Quarkus Platform.
zh_cn: 此扩展程序由第三方开发，是 Quarkus 平台的一部分。

source: This feature is considered experimental and is likely to change in future versions of Quarkus.
zh_cn: 这个功能是实验性的，在未来的Quarkus版本中可能会有变化。

source: This feature is handy when using third-party libraries using object mapping features (such as Jackson or GSON):
zh_cn: 在运用使用对象映射功能的第三方库（如Jackson或GSON）时，这个功能很方便：

source: This generation can be disabled using:
zh_cn: 可以用以下方法禁用这种生成机制：

source: This guide also covers the testing of the endpoint.
zh_cn: 本指南还包括对终端的测试。

source: This guide assumes you already have the completed application from the `getting-started` directory.
zh_cn: 本指南假设您已经准备好了 `getting-started` 目录中的应用。

source: This guide contains various tips and tricks for getting around problems that might arise when attempting to run Java applications as native executables.
zh_cn: 本指南包含各种提示和技巧，以解决在尝试以本地可执行文件形式运行Java应用程序时可能出现的问题。

source: This guide covered the creation of a native (binary) executable for your application. It provides an application exhibiting a swift startup time and consuming less memory. However, there is much more.
zh_cn: 本指南介绍了如何为应用程序创建原生(二进制)可执行文件。它提供了一个具备快速启动时间和消耗更少内存的应用程序。然而，还有更多。

source: This guide covered the creation of an application using Quarkus. However, there is much more. We recommend continuing the journey with the xref:building-native-image.adoc[building a native executable guide], where you learn about creating a native executable and packaging it in a container. If you are interested in reactive, we recommend the xref:getting-started-reactive.adoc[Getting Started with Reactive guide], where you can see how to implement reactive applications with Quarkus.
zh_cn: 本指南涵盖了使用 Quarkus 创建应用程序的内容。 然而，下面还有更多内容。 我们建议您继续学习 xref:building-native-image.adoc[构建本地可执行文件指南]，您可以在其中了解如何创建本地可执行文件并将其打包到容器中。 如果您对响应式感兴趣，我们推荐 xref:getting-started-reactive.adoc[响应式入门指南]，您可以在其中了解如何使用 Quarkus 实现响应式应用程序。

source: This guide covers how to deploy a native application on Kubernetes.
zh_cn: 本指南涵盖了如何在Kubernetes上部署一个原生应用程序。

source: This guide covers how to deploy a native application on OpenShift.
zh_cn: 本指南涵盖了如何在OpenShift上部署一个原生应用程序。

source: This guide covers how to use GCP BigQuery in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP BigQuery。

source: This guide covers how to use GCP Bigtable in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP Bigtable。

source: This guide covers how to use GCP Firestore in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP Firestore。

source: This guide covers how to use GCP PubSub in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP PubSub。

source: This guide covers how to use GCP Secret Manager in Quarkus to consume configuration properties directly or via your `application.properties`.
zh_cn: 本指南介绍了如何在Quarkus中使用GCP Secret Manager直接或通过 `application.properties` 来使用配置属性。

source: This guide covers how to use GCP Spanner in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP Spanner。

source: This guide covers how to use GCP Storage in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用GCP存储。

source: This guide covers how to use Hibernate Validator/Bean Validation in your REST services.
zh_cn: 本指南包括如何在REST服务中使用Hibernate验证器/Bean验证。

source: This guide covers how to use MongoDB in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用MongoDB。

source: This guide covers how to use a Redis datastore in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用Redis数据存储。

source: This guide covers how to use an Elasticsearch cluster using the low level or high level REST clients.
zh_cn: 本指南涵盖了如何使用低级或高级的REST客户端来使用Elasticsearch集群。

source: This guide covers how to use multiple GCP services.
zh_cn: 本指南包括如何使用多种GCP服务。

source: This guide covers how to use the AWS Systems Manager in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用AWS系统管理器。

source: This guide covers how to use the Amazon DynamoDB database in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用Amazon DynamoDB数据库。

source: This guide covers how to use the Amazon Identity and Access Management in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用亚马逊身份和访问管理。

source: This guide covers how to use the Amazon Key Management Service in Quarkus.
zh_cn: 本指南介绍了如何在Quarkus中使用亚马逊密钥管理服务。

source: This guide covers how to use the Amazon S3 cloud storage in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用Amazon S3云存储。

source: This guide covers how to use the Amazon Simple Email Service in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用亚马逊简单电子邮件服务。

source: This guide covers how to use the Amazon Simple Notification Service in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用亚马逊简单通知服务。

source: This guide covers how to use the Amazon Simple Queue Service in Quarkus.
zh_cn: 本指南涵盖了如何在Quarkus中使用Amazon Simple Queue Service。

source: This guide covers how to use the Apache Cassandra NoSQL database in Quarkus.
zh_cn: 本指南包括如何在Quarkus中使用Apache Cassandra NoSQL数据库。

source: This guide covers how to use the Flyway extension to manage your schema migrations.
zh_cn: 本指南包括如何使用Flyway扩展来管理你的模式迁移。

source: This guide covers how to use the Liquibase extension to manage your schema migrations.
zh_cn: 本指南涵盖了如何使用Liquibase扩展来管理你的模式迁移。

source: This guide covers how to use the Neo4j graph database in Quarkus.
zh_cn: 本指南介绍了如何在Quarkus中使用Neo4j图数据库。

source: This guide covers how to use the Reactive SQL Clients in Quarkus.
zh_cn: 本指南涵盖了如何在Quarkus中使用响应式SQL客户端。

source: This guide covers the systems integration with Apache Camel
zh_cn: 本指南包括与Apache Camel的系统集成

source: This guide covers the usage of MongoDB using active records and repositories in a Kotlin project.
zh_cn: 本指南涵盖了在Kotlin项目中使用活动记录和存储库的MongoDB的用法。
